function lookf(){
	var day,month;
	var img = document.createElement('img');
	day=document.getElementById('day').value;
	day=parseInt(day)
	month=document.getElementById('month').value;
	month=parseInt(month)
	switch(month){
		case 1: 
			if (day<21){
			document.getElementById('znak').innerHTML='Козеріг';
  			document.getElementById('info').innerHTML="Людей, які народилися під знаком Козерога, об'єднує велика життєва стійкість і терпляче прагнення до хорошого результату в усьому. Вони пишаються своїм розумом, хоч іноді й безпідставно, і, якщо не ліниві, докладають масу зусиль для розвитку інтелектуальних здібностей. Козероги взагалі з тих, хто може навчатися протягом усього життя.";
			}else{
			document.getElementById('znak').innerHTML='Водолій';
  			document.getElementById('info').innerHTML='Люди, народжені під знаком Водолія, відрізняються особливою чутливістю і ранимістю. Вони можуть бути оточені знайомими, але рідко мають близьких друзів, яким можуть довіритись. Цікаво, що Водолії як магнітом притягують до себе неврівноважених людей, схильних до необачних вчинків. Але, оскільки друзів, як і ворогів, Водолії переважно вибирають раз і назавжди, вони не виключають і таких знайомих з кола свого спілкування.';
  		}
		break;
		case 2: 
			if (day<19){
			document.getElementById('znak').innerHTML='Водолій';	
  			document.getElementById('info').innerHTML='Люди, народжені під знаком Водолія, відрізняються особливою чутливістю і ранимістю. Вони можуть бути оточені знайомими, але рідко мають близьких друзів, яким можуть довіритись. Цікаво, що Водолії як магнітом притягують до себе неврівноважених людей, схильних до необачних вчинків. Але, оскільки друзів, як і ворогів, Водолії переважно вибирають раз і назавжди, вони не виключають і таких знайомих з кола свого спілкування.';
			}else{
			document.getElementById('znak').innerHTML='Риби';
  			document.getElementById('info').innerHTML='Одна з найбільш цікавих особливостей Риб - вміння подивитися на себе з боку і оцінити як сильні, так і слабкі сторони. Добре знаючи, що їм під силу, а що ні, представники цього знаку ставляться до власної персони трохи іронічно, а от від інших вимагають серйозності.';
  		}
		break;
		case 3: 
			if (day<20){
			document.getElementById('znak').innerHTML='Риби';	
  			document.getElementById('info').innerHTML='Одна з найбільш цікавих особливостей Риб - вміння подивитися на себе з боку і оцінити як сильні, так і слабкі сторони. Добре знаючи, що їм під силу, а що ні, представники цього знаку ставляться до власної персони трохи іронічно, а от від інших вимагають серйозності.';
			}else{
			document.getElementById('znak').innerHTML='Овен';
  			document.getElementById('info').innerHTML='"Овен" має честь відкривати зодіакальний гороскоп в точці весняного рівнодення: коли знаки Зодіаку отримали свої сучасні назви, вона перебувала саме в цьому сузір`ї. Тим часом, люди, що народилися під цим знаком, володіють достатньою силою і цілеспрямованістю, щоб пробитися вперед навіть в тих випадках, коли обставини, здавалося б, складаються не на їхню користь.';
		}
		break;
		case 4: 
			if (day<20){
			document.getElementById('znak').innerHTML='Овен';
			document.getElementById('info').innerHTML='"Овен" має честь відкривати зодіакальний гороскоп в точці весняного рівнодення: коли знаки Зодіаку отримали свої сучасні назви, вона перебувала саме в цьому сузір`ї. Тим часом, люди, що народилися під цим знаком, володіють достатньою силою і цілеспрямованістю, щоб пробитися вперед навіть в тих випадках, коли обставини, здавалося б, складаються не на їхню користь.';
			}else{
			document.getElementById('znak').innerHTML='Телець';
  			document.getElementById('info').innerHTML='Тільці мають благородний і незалежний характер. Маючи силу, вони, як не дивно, не поспішають її використовувати, чекаючи на найкращу нагоду, але частенько упускаючи її. Наполеглива праця, а не везіння, сталість, а не порив - ось ключ до успіху в житті Тільців.';
		}
		break;
		case 5: 
			if (day<21){
			document.getElementById('znak').innerHTML='Телець';	
  			document.getElementById('info').innerHTML='Тільці мають благородний і незалежний характер. Маючи силу, вони, як не дивно, не поспішають її використовувати, чекаючи на найкращу нагоду, але частенько упускаючи її. Наполеглива праця, а не везіння, сталість, а не порив - ось ключ до успіху в житті Тільців.';
			}else{
			document.getElementById('znak').innerHTML='Близнюки';
  			document.getElementById('info').innerHTML='Близнюків відрізняє від представників інших знаків особлива подвійність, мінливість в багатьох проявах. Вони здатні оцінювати ситуацію з двох сторін одночасно, випробовувати в один і той же момент любов і ненависть, і іноді навіть самі не розуміють складної природи своїх почуттів.';
  		}
		break;
		case 6: 
			if (day<21){
			document.getElementById('znak').innerHTML='Близнюки';	
  			document.getElementById('info').innerHTML='Близнюків відрізняє від представників інших знаків особлива подвійність, мінливість в багатьох проявах. Вони здатні оцінювати ситуацію з двох сторін одночасно, випробовувати в один і той же момент любов і ненависть, і іноді навіть самі не розуміють складної природи своїх почуттів.';
			}else{
			document.getElementById('znak').innerHTML='Рак';
  			document.getElementById('info').innerHTML='Люди, що народилися під цим знаком, відрізняються особливою чутливістю - навіть мимохіть вимовлене недобре слово здатне повергнути їх у депресію; при цьому Рак має досить сильної внутрішньої енергії, і можна не сумніватися, що його пригнічений стан швидко передасться навколишнім. Але не варто уявляти Рака постійним меланхоліком, щомиті страждають від недосконалості світу - посміятися він теж любить і почуттям гумору наділений досить непоганим.';
  		}
		break;
		case 7: 
			if (day<22){
			document.getElementById('znak').innerHTML='Рак';	
  			document.getElementById('info').innerHTML='Люди, що народилися під цим знаком, відрізняються особливою чутливістю - навіть мимохіть вимовлене недобре слово здатне повергнути їх у депресію; при цьому Рак має досить сильної внутрішньої енергії, і можна не сумніватися, що його пригнічений стан швидко передасться навколишнім. Але не варто уявляти Рака постійним меланхоліком, щомиті страждають від недосконалості світу - посміятися він теж любить і почуттям гумору наділений досить непоганим.';
			}else{
			document.getElementById('znak').innerHTML='Лев';
  			document.getElementById('info').innerHTML='Леви відрізняються лінивою силою і величезною амбітністю. Прагнення досягти вершин в усьому переслідує Левів все життя, однак знаходить реалізацію швидше в очікуванні благ від долі, ніж в активній боротьбі за них; коли успіх нарешті знаходить Лева, він приймає це як належне.';
		}
		break;
		case 8: 
			if (day<22){
			document.getElementById('znak').innerHTML='Лев';	
  			document.getElementById('info').innerHTML='Леви відрізняються лінивою силою і величезною амбітністю. Прагнення досягти вершин в усьому переслідує Левів все життя, однак знаходить реалізацію швидше в очікуванні благ від долі, ніж в активній боротьбі за них; коли успіх нарешті знаходить Лева, він приймає це як належне.';
			}else{
			document.getElementById('znak').innerHTML='Діва';
  			document.getElementById('info').innerHTML='На перший погляд Діви здаються багатьом загрузлими в матеріальних проблемах і побутових дрібницях, але це враження оманливе. Просто ці люди надзвичайно уважні і мимоволі відзначають недосконалості цього світу, особливо в тих областях, де виправити ситуацію в їхніх силах. Саме тому середньостатистична Діва печеться про чистоту в будинку - подібно Маленькому принцу, людина цього знаку намагається привести в порядок свою планету, а якщо це неможливо, то хоча б належний йому куточок.';
		}
		break;
		case 9: 
			if (day<23){
			document.getElementById('znak').innerHTML='Діва';	
  			document.getElementById('info').innerHTML='На перший погляд Діви здаються багатьом загрузлими в матеріальних проблемах і побутових дрібницях, але це враження оманливе. Просто ці люди надзвичайно уважні і мимоволі відзначають недосконалості цього світу, особливо в тих областях, де виправити ситуацію в їхніх силах. Саме тому середньостатистична Діва печеться про чистоту в будинку - подібно Маленькому принцу, людина цього знаку намагається привести в порядок свою планету, а якщо це неможливо, то хоча б належний йому куточок.';
			}else{
			document.getElementById('znak').innerHTML='Терези';
  			document.getElementById('info').innerHTML='Люди, що народилися під цим знаком, скромні, чарівні і доброзичливі. Вони не ображаються через дрібниці і намагаються не завдавати болю близьким, прагнення та бажання яких здатні вгадувати завдяки надзвичайно розвиненій інтуїції. Здатність Терезів передбачати майбутнє вражаюча, особливо в поєднанні з їх легким, не потьмареним містичними передчуттями характером.';
		}
		break;
		case 10: 
			if (day<23){
			document.getElementById('znak').innerHTML='Терези';	
  			document.getElementById('info').innerHTML='Люди, що народилися під цим знаком, скромні, чарівні і доброзичливі. Вони не ображаються через дрібниці і намагаються не завдавати болю близьким, прагнення та бажання яких здатні вгадувати завдяки надзвичайно розвиненій інтуїції. Здатність Терезів передбачати майбутнє вражаюча, особливо в поєднанні з їх легким, не потьмареним містичними передчуттями характером.';
			}else{
			document.getElementById('znak').value='Скорпіон';
  			document.getElementById('info').innerHTML='Скорпіон, мабуть, запропонує захопленому астрологією досліднику найбільшу різноманітність характерів і рис; під цим знаком народжуються матеріалісти і містики, гуманісти і раби власних низьких пристрастей, люди колосального інтелекту і рідкісною дурості. Зустрівши Скорпіона, Ви можете бути впевнені в одному - з ним буде цікаво, але майже завжди небезпечно. У будь-якому випадку, це не та людина, в присутності якого можна розслабитися.';
		}
		break;
		case 11: 
			if (day<23){
			document.getElementById('znak').innerHTML='Скорпіон';	
  			document.getElementById('info').innerHTML='Скорпіон, мабуть, запропонує захопленому астрологією досліднику найбільшу різноманітність характерів і рис; під цим знаком народжуються матеріалісти і містики, гуманісти і раби власних низьких пристрастей, люди колосального інтелекту і рідкісною дурості. Зустрівши Скорпіона, Ви можете бути впевнені в одному - з ним буде цікаво, але майже завжди небезпечно. У будь-якому випадку, це не та людина, в присутності якого можна розслабитися.';
			}else{
			document.getElementById('znak').innerHTML='Стрілець';
  			document.getElementById('info').innerHTML='Стрільці протягом усього життя відрізняються активністю як розуму, так і тіла, тому зазвичай дуже гармонійно розвинуті і часто перебувають у хорошому настрої. Вони цінують відвертість, невимушеність і свободу, а будь-які обмеження сприймають болісно.';
		}
		break;
		case 12: 
			if (day<22){
			document.getElementById('znak').innerHTML='Стрілець';
  			document.getElementById('info').innerHTML='Стрільці протягом усього життя відрізняються активністю як розуму, так і тіла, тому зазвичай дуже гармонійно розвинуті і часто перебувають у хорошому настрої. Вони цінують відвертість, невимушеність і свободу, а будь-які обмеження сприймають болісно.';
			}else{
			document.getElementById('znak').innerHTML='Козеріг';
  			document.getElementById('info').innerHTML="Людей, які народилися під знаком Козерога, об'єднує велика життєва стійкість і терпляче прагнення до хорошого результату в усьому. Вони пишаються своїм розумом, хоч іноді й безпідставно, і, якщо не ліниві, докладають масу зусиль для розвитку інтелектуальних здібностей. Козероги взагалі з тих, хто може навчатися протягом усього життя.";
		}
		break;
	}
}
